#ifndef SKIRL_H
#define SKIRL_H

struct Quad
{
    short int re;
    short int im;
};

// Параметры:
//  path — путь к файлу
//  w — адрес переменной, в которую будет сохранена ширина массива
//  h — адрес переменной, в которую будет сохранена высота массива
//      (число строк)
// Возвращаемое значение: двумерный массив отсчетов, оформленный как
// массив из массивов, либо NULL, если не удалось прочитать массив.
Quad** readArray(const char* path, int* w, int* h);

// Параметры:
//  ar — адрес массива, записываемого в файл
//  path — путь к файлу, в который следует сохранить данные
//  w, h — ширина и высота массива соответственно
// Возвращаемое значение: 0 в случае успешной записи, -1 в случае
// ошибки.
int writeArray(Quad** ar, const char* path, int w, int h);

// Освобождает память, выделенную для массива.
// Параметры:
// ar — указатель на массив
// h — количество строк в массиве
void clearArray(Quad** ar, int h);

#endif // SKIRL_H
